[
  {
    "title": "An explainable deep learning model to prediction dental caries using panoramic radiograph images",
    "source_url": "https://www.mdpi.com/2075-4418/13/2/226",
    "pdf_url": "https://www.mdpi.com/2075-4418/13/2/226/pdf?version=1673085147",
    "yazarlar": "Faruk Oztekin, Oguzhan Katar, Ferhat Sadak, Muhammed Yildirim, Hakan Cakar, Murat Aydogan, Zeynep Ozpolat, Tuba Talo Yildirim, Ozal Yildirim, Oliver Faust, U Rajendra Acharya",
    "yayın_tarihi": "2023/1/7",
    "dergi": "Diagnostics",
    "cilt": "13",
    "sayı": "2",
    "sayfalar": "226",
    "yayıncı": "MDPI",
    "açıklama": "Dental caries is the most frequent dental health issue in the general population. Dental caries can result in extreme pain or infections, lowering people’s quality of life. Applying machine learning models to automatically identify dental caries can lead to earlier treatment. However, physicians frequently find the model results unsatisfactory due to a lack of explainability. Our study attempts to address this issue with an explainable deep learning model for detecting dental caries. We tested three prominent pre-trained models, EfficientNet-B0, DenseNet-121, and ResNet-50, to determine which is best for the caries detection task. These models take panoramic images as the input, producing a caries–non-caries classification result and a heat map, which visualizes areas of interest on the tooth. The model performance was evaluated using whole panoramic images of 562 subjects. All three models produced remarkably similar results. However, the ResNet-50 model exhibited a slightly better performance when compared to EfficientNet-B0 and DenseNet-121. This model obtained an accuracy of 92.00%, a sensitivity of 87.33%, and an F1-score of 91.61%. Visual inspection showed us that the heat maps were also located in the areas with caries. The proposed explainable deep learning model diagnosed dental caries with high accuracy and reliability. The heat maps help to explain the classification results by indicating a region of suspected caries on the teeth. Dentists could use these heat maps to validate the classification results and reduce misclassification.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 7920232024202584030",
    "google_akademik_makaleleri": "An explainable deep learning model to prediction dental caries using panoramic radiograph imagesF Oztekin, O Katar, F Sadak, M Yildirim, H Cakar… - Diagnostics, 2023Alıntılanma sayısı: 79İlgili makaleler11 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Evaluation of GPT-3 AI language model in research paper writing",
    "source_url": "https://dergipark.org.tr/en/pub/tjst/article/1272369",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/3040965",
    "yazarlar": "Oguzhan Katar, Dilek Ozkan, GPT-3, Ozal Yildirim, Acharya U Rajendra",
    "yayın_tarihi": "2022/12",
    "kaynak": "http://dx.doi.org/10.13140/RG.2.2.11949.15844",
    "açıklama": "Artificial intelligence (AI) has helped to obtain accurate, fast, robust results without any human errors.Hence, it has been used in various applications in our daily lives. The Turing test has been afundamental problem that AI systems aim to overcome. Recently developed various natural language problem (NLP) models have shown significant performances. AI language models, used intranslation, digital assistant, and sentiment analysis, have improved the quality of our lives. It canperform scans on thousands of documents in seconds and report them by establishing appropriatesentence structures. Generative pre-trained transformer (GPT)-3 is a popular model developedrecently has been used for many applications. Users of this model have obtained surprising results onvarious applications and shared them on various social media platforms. This study aims to evaluatethe performance of the GPT-3 model in writing an academic article. Hence, we chose the subject ofthe article as tools based on artificial intelligence in academic article writing. The organized querieson GPT-3 created the flow of this article. In this article, we have made an effort to highlight theadvantages and limitations of using GPT-3 for research paper writing. Authors feel that it can be usedas an adjunct tool while writing research papers.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 342023202420257188",
    "google_akademik_makaleleri": "Evaluation of GPT-3 AI language model in research paper writingO Katar, D Özkan, Ö Yıldırım, UR Acharya - Turkish Journal of Science and Technology, 2023Alıntılanma sayısı: 34İlgili makaleler3 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "An explainable vision transformer model based white blood cells classification and localization",
    "source_url": "https://www.mdpi.com/2075-4418/13/14/2459",
    "pdf_url": "https://www.mdpi.com/2075-4418/13/14/2459/pdf?version=1690196115",
    "yazarlar": "Oguzhan Katar, Ozal Yildirim",
    "yayın_tarihi": "2023/7/24",
    "dergi": "Diagnostics",
    "cilt": "13",
    "sayı": "14",
    "sayfalar": "2459",
    "yayıncı": "MDPI",
    "açıklama": "White blood cells (WBCs) are crucial components of the immune system that play a vital role in defending the body against infections and diseases. The identification of WBCs subtypes is useful in the detection of various diseases, such as infections, leukemia, and other hematological malignancies. The manual screening of blood films is time-consuming and subjective, leading to inconsistencies and errors. Convolutional neural networks (CNN)-based models can automate such classification processes, but are incapable of capturing long-range dependencies and global context. This paper proposes an explainable Vision Transformer (ViT) model for automatic WBCs detection from blood films. The proposed model uses a self-attention mechanism to extract features from input images. Our proposed model was trained and validated on a public dataset of 16,633 samples containing five different types of WBCs. As a result of experiments on the classification of five different types of WBCs, our model achieved an accuracy of 99.40%. Moreover, the model’s examination of misclassified test samples revealed a correlation between incorrect predictions and the presence or absence of granules in the cell samples. To validate this observation, we divided the dataset into two classes, Granulocytes and Agranulocytes, and conducted a secondary training process. The resulting ViT model, trained for binary classification, achieved impressive performance metrics during the test phase, including an accuracy of 99.70%, recall of 99.54%, precision of 99.32%, and F-1 score of 99.43%. To ensure the reliability of the ViT model’s, we employed the Score-CAM …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 3320232024202541216",
    "google_akademik_makaleleri": "An explainable vision transformer model based white blood cells classification and localizationO Katar, O Yildirim - Diagnostics, 2023Alıntılanma sayısı: 33İlgili makaleler12 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Automatic semantic segmentation for dental restorations in panoramic radiography images using U‐Net model",
    "source_url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ima.22803",
    "pdf_url": "https://onlinelibrary.wiley.com/doi/epdf/10.1002/ima.22803",
    "yazarlar": "Faruk Oztekin, Oguzhan Katar, Ferhat Sadak, Murat Aydogan, Tuba Talo Yildirim, Pawel Plawiak, Ozal Yildirim, Muhammed Talo, Murat Karabatak",
    "yayın_tarihi": "2022/11",
    "dergi": "International Journal of Imaging Systems and Technology",
    "cilt": "32",
    "sayı": "6",
    "sayfalar": "1990-2001",
    "yayıncı": "John Wiley & Sons, Inc.",
    "açıklama": "The automated segmentation of dental restorations is a critical step in diagnosing dental problems and suggesting the best treatment. Some restorations may be missed during a dental examination, depending on the number of patients, the dentist's experience, and fatigue. Automatic detection of dental restorations based on deep learning has the potential to provide a quick radiological assessment based on the patient's treatment history and pre‐diagnosis. This study presents a deep learning‐based method for automatic detection and classification of amalgam and composite fillings on panoramic images. A total of 250 anonymized panoramic images with amalgam and composite fillings with a resolution of 2048 × 1024 px were used. In this study, U‐Net models with various backbones were employed. The ResNext50 model has achieved the highest pixel accuracy and intersection over union (IoU …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 21202320242025686",
    "google_akademik_makaleleri": "Automatic semantic segmentation for dental restorations in panoramic radiography images using U‐Net modelF Oztekin, O Katar, F Sadak, M Aydogan, TT Yildirim… - International Journal of Imaging Systems and …, 2022Alıntılanma sayısı: 21İlgili makaleler6 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "A deep learning model collaborates with an expert radiologist to classify brain tumors from MR images",
    "source_url": "https://dergipark.org.tr/en/pub/tjst/issue/72762/1143392",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2536823",
    "yazarlar": "Tülin Öztürk, Oğuzhan Katar",
    "yayın_tarihi": "2022/7/1",
    "dergi": "Turkish Journal of Science and Technology",
    "cilt": "17",
    "sayı": "2",
    "sayfalar": "203-210",
    "yayıncı": "Fırat University",
    "açıklama": "The brain, which consists of nerve cells called neurons, is the center of the nervous system. The rapid and abnormal growth of nerve cells by interacting with each other is called a brain tumor. Undiagnosed or delayed diagnosis of brain tumors lead to death. Although it depends on experience, manually diagnosing and classifying brain tumors is challenging for physicians. Artificial intelligence-based computer systems can help doctors detect brain tumors using the developments in hardware technology and the amount of data increasing daily. This study proposes a deep learning-based system to classify brain MRI images as tumorous or normal using the pre-trained EfficientNet-B0 model. Our radiologist validated a public dataset containing 3000 brain MRI images. The dataset is divided into 70% train, 20% validation, and 10% test. In the test phase after the training, the pre-trained EfficientNet-B0 model achieved high performance with 99.33% accuracy, 99.33% sensitivity, and 99.33% F1 score. In addition, in the evaluation of the test images, the heat maps obtained by the Grad-CAM method were examined by our radiology specialist. The result of evaluations shows that the pre-trained EfficientNet-B0 deep model chooses the right focus areas in its predictions and can be used for clinical tumor detection due to its explainable structure.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 132021202220232024202511433",
    "google_akademik_makaleleri": "A deep learning model collaborates with an expert radiologist to classify brain tumors from MR imagesT Öztürk, O Katar - Turkish Journal of Science and Technology, 2022Alıntılanma sayısı: 13İlgili makaleler5 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Comparison of explainable artificial intelligence model and radiologist review performances to detect breast cancer in 752 patients",
    "source_url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/jum.16535",
    "pdf_url": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/jum.16535",
    "yazarlar": "Pelin Seher Oztekin, Oguzhan Katar, Tulay Omma, Serap Erel, Oguzhan Tokur, Derya Avci, Murat Aydogan, Ozal Yildirim, Engin Avci, U Rajendra Acharya",
    "yayın_tarihi": "2024/11",
    "dergi": "Journal of Ultrasound in Medicine",
    "cilt": "43",
    "sayı": "11",
    "sayfalar": "2051-2068",
    "yayıncı": "John Wiley & Sons, Inc.",
    "açıklama": "ObjectivesBreast cancer is a type of cancer caused by the uncontrolled growth of cells in the breast tissue. In a few cases, erroneous diagnosis of breast cancer by specialists and unnecessary biopsies can lead to various negative consequences. In some cases, radiologic examinations or clinical findings may raise the suspicion of breast cancer, but subsequent detailed evaluations may not confirm cancer. In addition to causing unnecessary anxiety and stress to patients, such diagnosis can also lead to unnecessary biopsy procedures, which are painful, expensive, and prone to misdiagnosis. Therefore, there is a need for the development of more accurate and reliable methods for breast cancer diagnosis.MethodsIn this study, we proposed an artificial intelligence (AI)‐based method for automatically classifying breast solid mass lesions as benign vs malignant. In this study, a new breast cancer dataset (Breast …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 1220242025210",
    "google_akademik_makaleleri": "Comparison of explainable artificial intelligence model and radiologist review performances to detect breast cancer in 752 patientsPS Oztekin, O Katar, T Omma, S Erel, O Tokur, D Avci… - Journal of Ultrasound in Medicine, 2024Alıntılanma sayısı: 12İlgili makaleler4 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Automatic classification of white blood cells using pre-trained deep models",
    "source_url": "https://dergipark.org.tr/en/download/article-file/2740488",
    "pdf_url": "PDF Yok",
    "yazarlar": "Oğuzhan Katar, İlhan Fırat Kılınçer",
    "yayın_tarihi": "2022/12/31",
    "dergi": "Sakarya University Journal of Computer and Information Sciences",
    "cilt": "5",
    "sayı": "3",
    "sayfalar": "462-476",
    "yayıncı": "Sakarya University",
    "açıklama": "White blood cells (WBCs), which are a crucial component of the immune system, help our body defend against infections and other diseases. Some diseases may cause our body to produce fewer WBCs than it requires. Therefore, WBCs are of great importance in medical imaging. Artificial intelligence-based computer systems can assist experts in analyzing WBCs. In this study, we proposed an approach for the automatic classification of WBCs into five different classes using a pre-trained model. We trained ResNet-50, VGG-19, and MobileNet-V3-Small pre-trained models with ImageNet weights. For the training, validation, and testing processes of the models, we used a public dataset containing 16,633 images with an uneven class distribution. While the ResNet-50 model achieved an accuracy of 98.79%, the VGG-19 model achieved an accuracy of 98.19%, and the MobileNet-V3-Small model achieved the highest accuracy rate at 98.86%. When examining the predictions of the MobileNet-V3-Small model, we observed that it was not affected by class dominance and was able to correctly classify even the least sampled class images in the dataset. In addition to the high accuracy achieved in the classification of WBCs using the proposed pre-trained deep learning models, we also applied the Grad-CAM method to further understand and interpret the model's predictions.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 11202120222023202420251433",
    "google_akademik_makaleleri": "Automatic classification of white blood cells using pre-trained deep modelsO Katar, İF Kılınçer - Sakarya University Journal of Computer and …, 2022Alıntılanma sayısı: 11İlgili makaleler7 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "A Novel Hybrid Model for Automatic Non-Small Cell Lung Cancer Classification Using Histopathological Images",
    "source_url": "https://www.mdpi.com/2075-4418/14/22/2497",
    "pdf_url": "https://www.mdpi.com/2075-4418/14/22/2497/pdf?version=1731415087",
    "yazarlar": "Oguzhan Katar, Ozal Yildirim, Ru-San Tan, U Rajendra Acharya",
    "yayın_tarihi": "2024/11/8",
    "dergi": "Diagnostics",
    "cilt": "14",
    "sayı": "22",
    "sayfalar": "2497",
    "yayıncı": "MDPI",
    "açıklama": "Background/Objectives: Despite recent advances in research, cancer remains a significant public health concern and a leading cause of death. Among all cancer types, lung cancer is the most common cause of cancer-related deaths, with most cases linked to non-small cell lung cancer (NSCLC). Accurate classification of NSCLC subtypes is essential for developing treatment strategies. Medical professionals regard tissue biopsy as the gold standard for the identification of lung cancer subtypes. However, since biopsy images have very high resolutions, manual examination is time-consuming and depends on the pathologist’s expertise.Methods: In this study, we propose a hybrid model to assist pathologists in the classification of NSCLC subtypes from histopathological images. This model processes deep, textural and contextual features obtained by using EfficientNet-B0, local binary pattern (LBP) and vision transformer (ViT) encoder as feature extractors, respectively. In the proposed method, each feature matrix is flattened separately and then combined to form a comprehensive feature vector. The feature vector is given as input to machine learning classifiers to identify the NSCLC subtype.Results: We set up 13 different training scenarios to test 4 different classifiers: support vector machine (SVM), logistic regression (LR), light gradient boosting machine (LightGBM) and extreme gradient boosting (XGBoost). Among these scenarios, we obtained the highest classification accuracy (99.87%) with the combination of EfficientNet-B0 + LBP + ViT Encoder + SVM. The proposed hybrid model significantly enhanced the classification accuracy of NSCLC …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 920258",
    "google_akademik_makaleleri": "A Novel Hybrid Model for Automatic Non-Small Cell Lung Cancer Classification Using Histopathological ImagesO Katar, O Yildirim, RS Tan, UR Acharya - Diagnostics, 2024Alıntılanma sayısı: 9İlgili makaleler8 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Vision transformer model for efficient stroke detection in neuroimaging",
    "source_url": "https://ieeexplore.ieee.org/abstract/document/10391051/",
    "pdf_url": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10391051",
    "yazarlar": "Oguzhan Katar, Ozal Yildirim, Yesim Eroglu",
    "yayın_tarihi": "2023/12/21",
    "konferans": "2023 4th International Informatics and Software Engineering Conference (IISEC)",
    "sayfalar": "1-6",
    "yayıncı": "IEEE",
    "açıklama": "A brain stroke occurs when blood flow to a part of the brain is disrupted, potentially caused by a blocked or ruptured blood vessel. Deprived of oxygen and nutrients, brain cells can start dying within minutes, leading to irreversible damage. Early diagnosis and treatment are crucial to minimize brain damage and improve recovery chances. Clinical assessments and imaging techniques like Computed Tomography (CT) and Magnetic Resonance Imaging (MRI) scans are commonly used for rapid detection, but manual analysis has limitations, including delays and subjectivity. AI-based models offer a faster and more consistent approach for stroke diagnosis, enhancing accuracy. In this study, an explainable Vision Transformer (ViT) model is proposed for stroke classification and localization from brain CT images. The model is validated on a dataset of 6,651 samples. To address an unbalanced dataset, two training …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 92024202536",
    "google_akademik_makaleleri": "Vision transformer model for efficient stroke detection in neuroimagingO Katar, O Yildirim, Y Eroglu - 2023 4th International Informatics and Software …, 2023Alıntılanma sayısı: 9İlgili makaleler",
    "author": "oğuzhan katar"
  },
  {
    "title": "Deep learning based Covid-19 detection with A novel CT images dataset: EFSCH-19",
    "source_url": "https://dergipark.org.tr/en/pub/ejosat/issue/65857/1021030",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2071207",
    "yazarlar": "Oğuzhan Katar, Erkan Duman",
    "yayın_tarihi": "2021",
    "dergi": "Avrupa Bilim ve Teknoloji Dergisi",
    "sayı": "29",
    "sayfalar": "150-155",
    "yayıncı": "Osman SAĞDIÇ",
    "açıklama": "COVID-19 pandemic has negatively affected the whole world in many ways. Since its inception, various methods and approaches have been developed. The common feature of these solution searches is minimizing the social and economic damages of the COVID-19 pandemic. In this article, we developed our deep learning-based model for the detection of COVID-19 disease from chest CT images. However, we did not use the publicly available datasets used in most studies in the literature. Because, in public datasets; there are problems such as low samples, incorrectly labeled images and unbalanced distribution. Due to such problems, we thought that our model would not reach the desired high accuracy values. We used our dataset, which has not been included in any deep learning study before, from Elazig Fethi Sekin City Hospital, for the first time in the training of our model. Our model was trained with 800 positive and 800 normal chest CT images and then tested with 400 randomly selected test images. As a result of these tests, accuracy rate of %97.5 was achieved. When the results of our study are evaluated, it is thought that it can help physicians in the detection of COVID-19 disease.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 8202220232024422",
    "google_akademik_makaleleri": "Deep learning based Covid-19 detection with A novel CT images dataset: EFSCH-19O Katar, E Duman - Avrupa Bilim ve Teknoloji Dergisi, 2021Alıntılanma sayısı: 8İlgili makaleler5 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Automated semantic segmentation for autonomous railway vehicles",
    "source_url": "https://hrcak.srce.hr/clanak/410699",
    "pdf_url": "PDF Yok",
    "yazarlar": "Oğuzhan Katar, Erkan Duman",
    "yayın_tarihi": "2022/9/23",
    "dergi": "Tehnički glasnik",
    "cilt": "16",
    "sayı": "4",
    "sayfalar": "484-490",
    "yayıncı": "Sveučilište Sjever",
    "açıklama": "With the development of computer vision methods, the number of areas where autonomous systems are used has also increased. Among these areas is the transportation sector. Autonomous systems in the transportation sector are mostly developed for road vehicles, but highway rules and standards different between countries. In this study, models capable of semantic segmentation have been developed for autonomous railway vehicles with the help of the public dataset. Four different U-Net models were trained with 8500 images for four different scenarios. The model trained for binary semantic segmentation reached mean Intersection over Union (mIoU) value of 89.1%, while the models trained for multi-class semantic segmentation reached 83.2% mIoU, 79.7% mIoU and 29.6% mIoU. Information about the inclusion of high-resolution images in model training and performance metrics in semantic segmentation studies shared.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 7202320242025331",
    "google_akademik_makaleleri": "Automated semantic segmentation for autonomous railway vehiclesO Katar, E Duman - Tehnički glasnik, 2022Alıntılanma sayısı: 7İlgili makaleler5 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "A Novel AI-based Hybrid Ensemble Segmentation CAD System for Lumber Spine Stenosis pathological Regions Using MRI Axial Images",
    "source_url": "https://ieeexplore.ieee.org/abstract/document/10710814/",
    "pdf_url": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10710814",
    "yazarlar": "Saied Salem, Raza Mukhlis, Oguzhan Katar, Bilal Ertuğrul, Ozal Yildirim, Mugahed A Al-Antari",
    "yayın_tarihi": "2024/9/21",
    "konferans": "2024 8th International Artificial Intelligence and Data Processing Symposium (IDAP)",
    "sayfalar": "1-5",
    "yayıncı": "IEEE",
    "açıklama": "Lumbar Spinal Stenosis (LSS) is a condition where the spinal canal in the lower back becomes narrower, resulting in pressure on the spinal cord and nearby nerves. To predict LSS, neurologists focus on four key regions in MRI axial scans: the Intervertebral Disc (IVD), Thecal Sac (TS), Posterior Element (PE), and the Area between the Anterior and Posterior (AAP) vertebrae. To delineate these regions, we present a novel hybrid ensemble deep learning CAD system for multi-class segmentation, encompassing data collection, preprocessing, automated hyperparameter optimization and selection, segmentation ensemble learning, and both qualitative and quantitative performance evaluation. The core of the proposed pipeline features two ensemble phases: (1) ensemble learning through feature space fusion of three distinct AI models (SwinUNETR, Attention Unet, and UNet++), and (2) ensemble learning via a …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 520255",
    "google_akademik_makaleleri": "A Novel AI-based Hybrid Ensemble Segmentation CAD System for Lumber Spine Stenosis pathological Regions Using MRI Axial ImagesS Salem, R Mukhlis, O Katar, B Ertuğrul, O Yildirim… - 2024 8th International Artificial Intelligence and Data …, 2024Alıntılanma sayısı: 5İlgili makaleler",
    "author": "oğuzhan katar"
  },
  {
    "title": "Deep learning techniques for automated dementia diagnosis using neuroimaging modalities: A systematic review (2012-2023)",
    "source_url": "https://ieeexplore.ieee.org/abstract/document/10666721/",
    "pdf_url": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10666721",
    "yazarlar": "Dilek Ozkan, Oguzhan Katar, Murat Ak, Mugahed A Al-Antari, Nehir Yasan Ak, Ozal Yildirim, Hasan S Mir, Ru-San Tan, U Rajendra Acharya",
    "yayın_tarihi": "2024/9/5",
    "kaynak": "IEEE Access",
    "yayıncı": "IEEE",
    "açıklama": "Dementia is a condition that often comes with aging and affects how people think, remember, and behave. Diagnosing dementia early is important because it can greatly improve patients’ lives. This systematic review looks at how deep learning (DL) techniques have been used to diagnose dementia automatically from 2012 to 2023. We explore how different DL methods like Convolutional Neural Networks (CNN), Recurrent Neural Networks (RNN), and Deep Neural Networks (DNN) are used to diagnose types of dementia such as Alzheimer’s, vascular dementia, and Lewy body dementia. We also discuss the difficulties of using DL for diagnosing dementia, like the lack of large and varied datasets and the challenge of applying models to different groups of people. These issues indicate the need for more dependable and understandable models that consider a wide range of patient characteristics and biomarkers …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 420253",
    "google_akademik_makaleleri": "Deep learning techniques for automated dementia diagnosis using neuroimaging modalities: A systematic review (2012-2023)D Ozkan, O Katar, M Ak, MA Al-Antari, NY Ak, O Yildirim… - IEEE Access, 2024Alıntılanma sayısı: 4İlgili makaleler4 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "A new Intrusion Detection System for Secured IoT/IIoT Networks based on LGBM",
    "source_url": "https://dergipark.org.tr/en/download/article-file/2642294",
    "pdf_url": "PDF Yok",
    "yazarlar": "İlhan Fırat KILINÇER, Oğuzhan KATAR",
    "yayın_tarihi": "2023/6/23",
    "dergi": "Gazi University Journal of Science Part C: Design and Technology",
    "cilt": "11",
    "sayı": "2",
    "sayfalar": "321-328",
    "yayıncı": "Gazi University",
    "açıklama": "The Internet of Things (IoT) is one of the technologies used in many fields today. Cyber attacks against IoT/Industrial IoT (IIoT) networks, which are increasingly used thanks to the convenience it provides, are constantly increasing. Detection of attacks against IoT/IIoT networks is one of the popular topics recently. The development of a dataset for IoT applications is essential for the intrusion detection in IoT networks. In this context, the ToN_IoT dataset created in the laboratory of UNSW Canberra (Australia) is one of the most comprehensive datasets that can be used to detect cyber attacks on IoT networks. In this study, fridge, garage door, GPS tracker, modbus, motion light, weather, thermostat datasets related to IoT sensors from ToN_IoT datasets were used. The datasets used were subjected to multi-class classification with the Light Gradient Boosting Machine (LGBM) classifier proposed in the study. The obtained results were compared with the literature and it was seen that the proposed method provided the highest classification performance in the literature. It has been determined that the proposed method is effective in preventing cyber attacks on IoT/IIoT networks.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 42024202531",
    "google_akademik_makaleleri": "A new intrusion detection system for secured IoT/IIoT networks based on LGBMİF KILINÇER, O Katar - Gazi University Journal of Science Part C: Design and …, 2023Alıntılanma sayısı: 4İlgili makaleler4 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "YOLOv5-based vehicle objects detection using UAV images",
    "source_url": "https://dergipark.org.tr/en/pub/forecasting/article/1145381",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2544729",
    "yazarlar": "Zeynep Nur Duman, Müzeyyen Büşra Çulcu, Oğuzhan Katar",
    "yayın_tarihi": "2022/8",
    "dergi": "Turkish Journal of Forecasting",
    "cilt": "6",
    "sayı": "1",
    "sayfalar": "40-45",
    "yayıncı": "Giresun University",
    "açıklama": "Traffic is the situation and movement of pedestrians, animals, and vehicles on highways. The regulation of these movements and situations is also a basic problem of traffic engineering. It is necessary to collect data about traffic in order to produce suitable solutions to problems by traffic engineers. Traffic data can be collected with equipment such as cameras and sensors. However, these data need to be analysed in order to transform them into meaningful information. For a difficult task such as calculating and optimizing traffic density, traffic engineers need information on the number of vehicles to be obtained from the image data they have collected. In this process, artificial intelligence-based computer systems can help researchers. This study proposes a deep learning-based system to detect vehicle objects using YOLOv5 model. A public dataset containing 15,474 high-resolution UAV images was used in the training of the model. Dataset samples were cropped to 640×640px sub-images, and sub-images that did not contain vehicle objects were filtered out. The filtered dataset samples were divided into 70% training, 20% validation, and 10% testing. The YOLOv5 model reached 99.66% precision, 99.44% recall, 99.66% mAP@0.5, and 89.35% mAP@0.5-0.95% during the training phase. When the determinations made by the model on the images reserved for the test phase are examined, it is seen that it has achieved quite successful results. By using the proposed approach in daily life, the detection of vehicle objects from high-resolution images can be automated with high success rates.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 4202320242025121",
    "google_akademik_makaleleri": "YOLOv5-based vehicle objects detection using UAV imagesZN Duman, MB Çulcu, O Katar - Turkish Journal of Forecasting, 2022Alıntılanma sayısı: 4İlgili makaleler2 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Classification of Malware Images Using Fine-Tunned ViT",
    "source_url": "https://dergipark.org.tr/en/download/article-file/3322952",
    "pdf_url": "PDF Yok",
    "yazarlar": "Oğuzhan Katar, Özal Yıldırım",
    "yayın_tarihi": "2024/4/30",
    "dergi": "Sakarya University Journal of Computer and Information Sciences",
    "cilt": "7",
    "sayı": "1",
    "sayfalar": "22-35",
    "yayıncı": "Sakarya University",
    "açıklama": "Identifying and classifying malware has become a critical task in ensuring the security and resilience of computer systems and networks. Traditional techniques for malware assessment often rely on signature-based methods, which struggle to keep up with the constantly evolving landscape of malware variations. Recently, the application of advanced deep learning methods has shown promising results in automating the malware classification process. This study presents an innovative strategy for classifying malware images using the Vision Transformer (ViT) architecture. The ViT model is adapted to the domain of malware analysis by representing malware images as input tokens. A comprehensive dataset of 14,226 malware samples from 26 families was used to evaluate the effectiveness of this approach. A comparative analysis was performed between the performance of the ViT-based classifier, traditional machine learning approaches and other deep learning architectures. Our experimental results demonstrate the potential of ViT in handling malware images, achieving a classification accuracy of 98.80%. The presented approach establishes a strong foundation for further research in utilizing cutting-edge deep learning architectures for enhanced malware analysis and detection techniques.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 32024202512",
    "google_akademik_makaleleri": "Classification of Malware Images Using Fine-Tunned ViTO Katar, Ö Yıldırım - Sakarya University Journal of Computer and …, 2024Alıntılanma sayısı: 3İlgili makaleler4 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Breast Cancer Segmentation from Ultrasound Images Using ResNext-based U-Net Model",
    "source_url": "https://dergipark.org.tr/en/pub/bitlisfen/issue/79967/1331310",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/3280919",
    "yazarlar": "Oğuzhan KATAR, Özal YILDIRIM",
    "yayın_tarihi": "2023",
    "dergi": "Bitlis Eren Üniversitesi Fen Bilimleri Dergisi",
    "cilt": "12",
    "sayı": "3",
    "sayfalar": "871-886",
    "yayıncı": "Bitlis Eren University",
    "açıklama": "Breast cancer is a type of cancer caused by the uncontrolled growth and proliferation of cells in the breast tissue. Differentiating between benign and malignant tumors is critical in the detection and treatment of breast cancer. Traditional methods of cancer detection by manual analysis of radiological images are time-consuming and error-prone due to human factors. Modern approaches based on image classifier deep learning models provide significant results in disease detection, but are not suitable for clinical use due to their black-box structure. This paper presents a semantic segmentation method for breast cancer detection from ultrasound images. First, an ultrasound image of any resolution is divided into 256×256 pixel patches by passing it through an image cropping function. These patches are sequentially numbered and given as input to the model. Features are extracted from the 256×256 pixel patches with pre-trained ResNext models placed in the encoder network of the U-Net model. These features are processed in the default decoder network of the U-Net model and estimated at the output with three different pixel values: benign tumor areas (1), malignant tumor areas (2) and background areas (0). The prediction masks obtained at the output of the decoder network are combined sequentially to obtain the final prediction mask. The proposed method is validated on a publicly available dataset of 780 ultrasound images of female patients. The ResNext-based U-Net model achieved 73.17% intersection over union (IoU) and 83.42% dice coefficient (DC) on the test images. ResNext-based U-Net models perform better than the default U …",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 32024202512",
    "google_akademik_makaleleri": "Breast Cancer Segmentation from Ultrasound Images Using ResNext-based U-Net ModelO Katar, Ö Yıldırım - Bitlis Eren Üniversitesi Fen Bilimleri Dergisi, 2023Alıntılanma sayısı: 3İlgili makaleler3 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "U-Net Based Car Detection Method For Unmanned Aerial Vehicles",
    "source_url": "https://dergipark.org.tr/en/pub/jesd/article/1087477",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2308239",
    "yazarlar": "Oğuzhan Katar, Erkan Duman",
    "yayın_tarihi": "2022",
    "dergi": "Mühendislik Bilimleri ve Tasarım Dergisi",
    "cilt": "10",
    "sayı": "4",
    "sayfalar": "1141-1154",
    "yayıncı": "Süleyman Demirel University",
    "açıklama": "With the developments in computer hardware technology, studies in the fields of computer vision and artificial intelligence has accelerated. However, the number of areas where autonomous systems are used has also increased. Among these areas are unmanned aerial vehicles, which are one of the most important parameters of today's military technology. In this study, which includes two different scenarios, we aimed to improve the vision capabilities of unmanned aerial vehicles based on artificial intelligence. Within the scope of Scenario-1, the U-Net model suitable for binary semantic segmentation method was trained with the help of images taken by unmanned aerial vehicle camera. Within the scope of Scenario-2, which is designed for moving or stationary vehicle detection, the U-Net model is trained in accordance with multi-class semantic segmentation method. In all these training processes, a publicly available dataset was used. The model trained for Scenario-1 reached mean Intersection over Union (mIoU) value of 84.3%, while the model trained for Scenario-2 reached 79.7% mIoU. In this study, approaches were shared about the use of high-resolution images in model training and testing stages. Applying such studies in the field can help improve precision and reliability in arms industry.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 22024202511",
    "google_akademik_makaleleri": "U-Net Based Car Detection Method For Unmanned Aerial VehiclesO Katar, E Duman - Mühendislik Bilimleri ve Tasarım Dergisi, 2022Alıntılanma sayısı: 2İlgili makaleler5 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "U-Net-Based Detection of Road and Lane Markings from High-Resolution Images",
    "source_url": "https://dergipark.org.tr/en/pub/jitsa/article/1172992",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2641052",
    "yazarlar": "Oğuzhan Katar",
    "yayın_tarihi": "2023",
    "dergi": "Akıllı Ulaşım Sistemleri ve Uygulamaları Dergisi",
    "cilt": "6",
    "sayı": "2",
    "sayfalar": "284-299",
    "yayıncı": "Bandirma Onyedi Eylul University",
    "açıklama": "With technological developments in the field of hardware, many autonomous systems are used in daily life. Autonomous vehicles designed for safe travel in the transportation sector perform dynamic environmental control with the help of sensors and cameras. These vehicles need to process the image data they receive from their cameras and transform them into meaningful information. Artificial intelligence-based approaches are very effective in transforming data into meaningful information. In this study, a U-Net-based system is proposed that can automatically detect and classify areas of road and lane markings from high-resolution images. A publicly available dataset was customized for the model's training, validation, and testing phases. The pre-processing phase designed to include high-resolution images in the training of the U-Net model is explained. Dataset samples are split into 70% training, 20% validation, and 10% testing. The training phase performed using the early stopping function is defined for a maximum of 100 epochs. The numerical data of the training and validation phases, which were carried out in accordance with the multi-class semantic segmentation method, were shared. As a result of the test phase of the proposed model, the lowest 37.14%, the highest 93.65%, and an average of 79.48% Intersection over Union (IoU) have been achieved. With this model, the classification and detection of road and lane markings areas can help the dynamic environment control of autonomous vehicles.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 120251",
    "google_akademik_makaleleri": "U-Net-Based Detection of Road and Lane Markings from High-Resolution ImagesO Katar - Akıllı Ulaşım Sistemleri ve Uygulamaları Dergisi, 2023Alıntılanma sayısı: 1İlgili makaleler3 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "A Deep Learning-Based System to Assist Radiologists in Detecting COVID-19 Disease from Chest Computed Tomography Images",
    "source_url": "https://dergipark.org.tr/en/pub/kfbd/issue/76193/1168320",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/2621673",
    "yazarlar": "Oğuzhan Katar, Erkan Duman",
    "yayın_tarihi": "2023",
    "dergi": "Karadeniz Fen Bilimleri Dergisi",
    "cilt": "13",
    "sayı": "1",
    "sayfalar": "72-96",
    "yayıncı": "Giresun University",
    "açıklama": "The COVID-19 pandemic has had a significant negative impact on the world in various ways. In an effort to mitigate the negative effects of the pandemic, this study proposes a deep learning approach for the automatic detection of COVID-19 from chest computed tomography (CT) images. This would enable healthcare professionals to more efficiently identify the presence of the virus and provide appropriate care and support to infected individuals. The proposed deep learning approach is based on binary classification and utilizes members of the pre-trained EfficientNet model family. These models were trained on a dataset of real patient images, called the EFSCH-19 dataset, to classify chest CT images as positive or negative for COVID-19. The results of the predictions made on the test images showed that all models achieved accuracy values of over 98%. Among these models, the EfficientNet-B2 model performed the best, with an accuracy of 99.75%, sensitivity of 99.50%, specificity of 100%, and an F1 score of 99.75%. In addition to the high accuracy achieved in the classification of chest CT images using the proposed pre-trained deep learning models, the gradient-weighted class activation mapping (Grad-CAM) method was also applied to further understand and interpret the model's predictions.",
    "toplam_alıntı_sayısı": "Alıntılanma sayısı: 120251",
    "google_akademik_makaleleri": "A Deep Learning-Based System to Assist Radiologists in Detecting COVID-19 Disease from Chest Computed Tomography ImagesO Katar, E Duman - Karadeniz Fen Bilimleri Dergisi, 2023Alıntılanma sayısı: 1İlgili makaleler2 sürümün hepsiKaradeniz Fen Bilimleri Dergisi*O KATAR, E DUMANİlgili makaleler2 sürümün hepsi",
    "author": "oğuzhan katar"
  },
  {
    "title": "Arrhythmia Detection in Multi-channel ECG Images: Vision Transformer and Explainable Approaches",
    "source_url": "https://www.sciencedirect.com/science/article/pii/S0950705125019276",
    "pdf_url": "https://www.sciencedirect.com/science/article/pii/S0950705125019276/pdf",
    "yazarlar": "Fatma MURATDURANAY, Ender MURAT, Oğuzhan KATAR, Yakup DEMİR, Ru-San TAN, Özal YILDIRIM, U Rajendra ACHARYA",
    "yayın_tarihi": "2025/11/10",
    "dergi": "Knowledge-Based Systems",
    "sayfalar": "114889",
    "yayıncı": "Elsevier",
    "açıklama": "The electrocardiogram(ECG) signals are usually converted to spectrogram images for analysis, but this approach has significant limitations. Firstly, it loses about time information, and secondly, it lacks resolution. In our research, we introduce an approach to directly convert ECG signals into PNG format and systematically sequentially incorporate each lead data. This method offers a precise depiction by maintaining the intricate temporal and spatial attributes of the signals through the use of Vision Transformer (ViT) models. The study evaluated the arrhythmia detection capabilities of four ViT models (ViT-B/224, ViT-L/224, ViT-B/384, ViT-L/384) for classifying ECG images. Six different Class Activation Mapping (CAM) techniques (ScoreCAM, EigenCAM, EigenGradCAM, GradCAM++, XGradCAM and LayerCAM) were employed to enhance model interpretability. Our best-performing model, ViT-B/384, achieved 96.79 …",
    "google_akademik_makaleleri": "Arrhythmia Detection in Multi-channel ECG Images: Vision Transformer and Explainable ApproachesF MURATDURANAY, E MURAT, O KATAR, Y DEMİR… - Knowledge-Based Systems, 2025İlgili makaleler",
    "author": "oğuzhan katar"
  },
  {
    "title": "Akciğer Kanseri Tespitinde Sınıf Aktivasyon Haritaları Kullanarak Açıklanabilir Derin Öğrenme Modeli ve Radyolog Değerlendirmesi",
    "source_url": "https://dergipark.org.tr/en/pub/researcher/issue/86566/1520786",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/4090526",
    "yazarlar": "Savaş Tunçer, Oğuzhan Katar, Tülin Öztürk, Özal Yıldırım",
    "yayın_tarihi": "2024/12/12",
    "dergi": "Researcher",
    "cilt": "4",
    "sayı": "02",
    "sayfalar": "64-75",
    "yayıncı": "Ankara Bilim University",
    "açıklama": "Akciğer kanseri dünya genelinde yaygın ve ölümcül olan kanser türlerinden biridir. Akciğer kanserinin erken tanısı, hastalığın tedavi edilebilir aşamada tespit edilmesine olanak tanır ve bu da hastanın yaşam şansını önemli ölçüde artırır.  Yapay zekânın bu alanda kullanımı, bir dizi avantaj sağlayarak hastalığın daha etkili bir şekilde tespitine yardımcı olabilir. Son zamanlarda derin öğrenme yaklaşımları görüntü sınıflandırma çalışmalarında baskın bir rol almaktadır. Derin öğrenme yöntemlerinin en önemli dezavantajlarından birisi kapalı-kutu yapısı nedeniyle güvenirlik açısından şeffaflık eksikliğidir. Bu amaçla açıklanabilir modeller önemli bir araştırma haline gelmiştir. Açıklanabilir derin öğrenme modelleri, genellikle sınıf aktivasyon haritaları (Class Activation Maps - CAM) gibi tekniklere dayanmaktadır. Bu çalışmada, akciğer kanseri tespitinde açıklanabilir bir derin öğrenme modeli oluşturulmuştur. Makale kapsamındaki deneysel çalışmalar, akciğer bilgisayarlı tomografi (BT) görüntülerini içeren ve açık erişimli bir veri seti üzerinde yürütülmüştür. Sınıflandırma aşamasında konvolüsyonel sinir ağları (KSA) tabanlı ResNet101V2, VGG16, MobileNetV2, DenseNet201 ve EfficientNetB0 modelleri kullanılmıştır. Deneysel sonuçlara göre EfficientNetB0 modeli %98.63 ile en yüksek sınıflandırma doğruluğuna ulaşmıştır. Sınıflandırıcı modele uygulanan farklı CAM teknikleri ile ısı haritaları elde edilmiştir. Elde edilen ısı haritaları uzman radyolog tarafından değerlendirilerek sonuçlar tartışılmıştır.",
    "google_akademik_makaleleri": "Akciğer Kanseri Tespitinde Sınıf Aktivasyon Haritaları Kullanarak Açıklanabilir Derin Öğrenme Modeli ve Radyolog DeğerlendirmesiS Tunçer, O Katar, T Öztürk, Ö Yıldırım - Researcher, 2024İlgili makaleler",
    "author": "oğuzhan katar"
  },
  {
    "title": "The Potential of Transformer-Based Models for Automated Lung Cancer Detection from CT Scans",
    "source_url": "https://dergipark.org.tr/en/pub/ejt/issue/92270/1582121",
    "pdf_url": "https://dergipark.org.tr/en/download/article-file/4352113",
    "yazarlar": "Oğuzhan Katar, Tülin Öztürk, Özal Yıldırım",
    "dergi": "European Journal of Technique (EJT)",
    "cilt": "15",
    "sayı": "1",
    "sayfalar": "44-50",
    "yayıncı": "Hibetullah KILIÇ",
    "açıklama": "Lung cancer is the most common type of cancer worldwide and the leading cause of cancer-related deaths. Early diagnosis and treatment can significantly increase the survival rate of this disease. Radiological methods used in the diagnosis of lung cancer, especially Computed Tomography (CT) imaging, allow tumors to be detected more precisely. However, manual analysis of these images is time consuming and error prone due to human factors. In this study, we compared the potential of three different transformer-based state-of-the-art models (ViT, DeiT and Swin Transformer) for automatic lung cancer detection. We collected 690 CT images including small cell lung cancer (SCLC), non-small cell lung cancer (NSCLC) and normal findings from a local hospital. Each image was carefully reviewed and labeled by our expert radiologist, and these labeled images were used to train the models. The ViT, DeiT and Swin Transformer models achieved accuracy rates of 91.3%, 84.1% and 80.4% respectively on the test samples. This study shows that the use of transformer-based models for lung cancer classification is promising in overcoming the difficulties in manual analysis.",
    "google_akademik_makaleleri": "The Potential of Transformer-Based Models for Automated Lung Cancer Detection from CT ScansO Katar, T Öztürk, Ö Yıldırım - European Journal of Technique (EJT)İlgili makaleler",
    "author": "oğuzhan katar"
  },
  {
    "title": "BİLGİSAYARLI TOMOGRAFİ GÖRÜNTÜLERİ ÜZERİNDE DERİN ÖĞRENME TABANLI COVID-19 TEŞHİSİNE YÖNELİK HEKİM KARAR DESTEK SİSTEMİ TASARIMI",
    "source_url": "https://www.researchgate.net/profile/Oguzhan-Katar-2/publication/364355455_BILGISAYARLI_TOMOGRAFI_GORUNTULERI_UZERINDE_DERIN_OGRENME_TABANLI_COVID-19_TESHISINE_YONELIK_HEKIM_KARAR_DESTEK_SISTEMI_TASARIMI/links/634ee6a896e83c26eb3463ba/BILGISAYARLI-TOMOGRAFI-GOeRUeNTUeLERI-UeZERINDE-DERIN-OeGRENME-TABANLI-COVID-19-TESHISINE-YOeNELIK-HEKIM-KARAR-DESTEK-SISTEMI-TASARIMI.pdf",
    "pdf_url": "PDF Yok",
    "yazarlar": "Oğuzhan KATAR",
    "açıklama": "Fırat Üniversitesi Fen Bilimleri Enstitüsü tez yazım kurallarına uygun olarak hazırladığım “Bilgisayarlı Tomografi Görüntüleri Üzerinde Derin Öğrenme Tabanlı COVID-19 Teşhisine Yönelik Hekim Karar Destek Sistemi Tasarımı” Başlıklı Yüksek Lisans Tezimin içindeki bütün bilgilerin doğru olduğunu, bilgilerin üretilmesi ve sunulmasında bilimsel etik kurallarına uygun davrandığımı, kullandığım bütün kaynakları atıf yaparak belirttiğimi, maddi ve manevi desteği olan tüm kurum/kuruluş ve kişileri belirttiğimi, burada sunduğum veri ve bilgileri unvan almak amacıyla daha önce hiçbir şekilde kullanmadığımı beyan ederim.",
    "google_akademik_makaleleri": "BİLGİSAYARLI TOMOGRAFİ GÖRÜNTÜLERİ ÜZERİNDE DERİN ÖĞRENME TABANLI COVID-19 TEŞHİSİNE YÖNELİK HEKİM KARAR DESTEK SİSTEMİ TASARIMIO KATARİlgili makaleler",
    "author": "oğuzhan katar"
  }
]